; domain
(define (domain n-puzzle-typed)
  (:requirements :typing)
  (:types position tile)
  (:predicates (at ?tile - tile ?position - position)
	       (neighbor ?p1 - position ?p2 - position) 
	       (empty ?position - position)
   )

  (:action move
     :parameters (?tile - tile ?from ?to - position)
     :precondition (and (neighbor ?from ?to)
			(at ?tile ?from)
			(empty ?to))
     :effect (and (at ?tile ?to) (empty ?from) 
		  (not (at ?tile ?from)) (not (empty ?to)))
  )
)

; problem
(define (problem n-puzzle-n3-s50)
(:domain n-puzzle-typed)
  (:objects p_1_1 p_1_2 p_1_3 p_2_1 p_2_2 p_2_3 p_3_1 p_3_2 p_3_3 - position t_1 t_2 t_3 t_4 t_5 t_6 t_7 t_8 - tile)
  (:init
    (at t_5 p_1_1)
    (at t_1 p_1_2)
    (at t_6 p_1_3)
    (empty p_2_1)
    (at t_3 p_2_2)
    (at t_2 p_2_3)
    (at t_7 p_3_1)
    (at t_8 p_3_2)
    (at t_4 p_3_3)
    (neighbor p_1_1 p_1_2)
    (neighbor p_1_2 p_1_1)
    (neighbor p_1_2 p_1_3)
    (neighbor p_1_3 p_1_2)
    (neighbor p_2_1 p_2_2)
    (neighbor p_2_2 p_2_1)
    (neighbor p_2_2 p_2_3)
    (neighbor p_2_3 p_2_2)
    (neighbor p_3_1 p_3_2)
    (neighbor p_3_2 p_3_1)
    (neighbor p_3_2 p_3_3)
    (neighbor p_3_3 p_3_2)
    (neighbor p_1_1 p_2_1)
    (neighbor p_2_1 p_1_1)
    (neighbor p_1_2 p_2_2)
    (neighbor p_2_2 p_1_2)
    (neighbor p_1_3 p_2_3)
    (neighbor p_2_3 p_1_3)
    (neighbor p_2_1 p_3_1)
    (neighbor p_3_1 p_2_1)
    (neighbor p_2_2 p_3_2)
    (neighbor p_3_2 p_2_2)
    (neighbor p_2_3 p_3_3)
    (neighbor p_3_3 p_2_3))
  (:goal (and
    (at t_1 p_1_1)
    (at t_2 p_1_2)
    (at t_3 p_1_3)
    (at t_4 p_2_1)
    (at t_5 p_2_2)
    (at t_6 p_2_3)
    (at t_7 p_3_1)
    (at t_8 p_3_2))))

; plan
1. (move t_5 p_1_1 p_2_1)
   deleted: (at t_5 p_1_1) (empty p_2_1)
   added: (at t_5 p_2_1) (empty p_1_1)
   goals met: 2 of 8
2. (move t_1 p_1_2 p_1_1)
   deleted: (at t_1 p_1_2) (empty p_1_1)
   added: (at t_1 p_1_1) (empty p_1_2)
   goals met: 3 of 8
3. (move t_3 p_2_2 p_1_2)
   deleted: (at t_3 p_2_2) (empty p_1_2)
   added: (at t_3 p_1_2) (empty p_2_2)
   goals met: 3 of 8
4. (move t_2 p_2_3 p_2_2)
   deleted: (at t_2 p_2_3) (empty p_2_2)
   added: (at t_2 p_2_2) (empty p_2_3)
   goals met: 3 of 8
5. (move t_6 p_1_3 p_2_3)
   deleted: (at t_6 p_1_3) (empty p_2_3)
   added: (at t_6 p_2_3) (empty p_1_3)
   goals met: 4 of 8
6. (move t_3 p_1_2 p_1_3)
   deleted: (at t_3 p_1_2) (empty p_1_3)
   added: (at t_3 p_1_3) (empty p_1_2)
   goals met: 5 of 8
7. (move t_2 p_2_2 p_1_2)
   deleted: (at t_2 p_2_2) (empty p_1_2)
   added: (at t_2 p_1_2) (empty p_2_2)
   goals met: 6 of 8
8. (move t_5 p_2_1 p_2_2)
   deleted: (at t_5 p_2_1) (empty p_2_2)
   added: (at t_5 p_2_2) (empty p_2_1)
   goals met: 7 of 8
9. (move t_7 p_3_1 p_2_1)
   deleted: (at t_7 p_3_1) (empty p_2_1)
   added: (at t_7 p_2_1) (empty p_3_1)
   goals met: 6 of 8
10. (move t_8 p_3_2 p_3_1)
   deleted: (at t_8 p_3_2) (empty p_3_1)
   added: (at t_8 p_3_1) (empty p_3_2)
   goals met: 5 of 8
11. (move t_4 p_3_3 p_3_2)
   deleted: (at t_4 p_3_3) (empty p_3_2)
   added: (at t_4 p_3_2) (empty p_3_3)
   goals met: 5 of 8
12. (move t_6 p_2_3 p_3_3)
   deleted: (at t_6 p_2_3) (empty p_3_3)
   added: (at t_6 p_3_3) (empty p_2_3)
   goals met: 4 of 8
13. (move t_5 p_2_2 p_2_3)
   deleted: (at t_5 p_2_2) (empty p_2_3)
   added: (at t_5 p_2_3) (empty p_2_2)
   goals met: 3 of 8
14. (move t_4 p_3_2 p_2_2)
   deleted: (at t_4 p_3_2) (empty p_2_2)
   added: (at t_4 p_2_2) (empty p_3_2)
   goals met: 3 of 8
15. (move t_8 p_3_1 p_3_2)
   deleted: (at t_8 p_3_1) (empty p_3_2)
   added: (at t_8 p_3_2) (empty p_3_1)
   goals met: 4 of 8
16. (move t_7 p_2_1 p_3_1)
   deleted: (at t_7 p_2_1) (empty p_3_1)
   added: (at t_7 p_3_1) (empty p_2_1)
   goals met: 5 of 8
17. (move t_4 p_2_2 p_2_1)
   deleted: (at t_4 p_2_2) (empty p_2_1)
   added: (at t_4 p_2_1) (empty p_2_2)
   goals met: 6 of 8
18. (move t_5 p_2_3 p_2_2)
   deleted: (at t_5 p_2_3) (empty p_2_2)
   added: (at t_5 p_2_2) (empty p_2_3)
   goals met: 7 of 8
19. (move t_6 p_3_3 p_2_3)
   deleted: (at t_6 p_3_3) (empty p_2_3)
   added: (at t_6 p_2_3) (empty p_3_3)
   goals met: 8 of 8
